[
  {
    "name": "μBTC (bit)",
    "technicalDefinition": "μBTC or bit stands for microbitcoin, also commonly referred to as a \"bit.\" It is a unit of Bitcoin equal to 0.000001 BTC (one millionth of a Bitcoin).",
    "definition": "A μBTC is one-millionth of a Bitcoin (0.000001 BTC).",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Accessibility",
    "technicalDefinition": "Accessibility in the context of Bitcoin design refers to ensuring that Bitcoin products and services can be used by the widest possible range of individuals, including those with disabilities, by following design standards and providing features that accommodate diverse needs and abilities.",
    "definition": "Accessibility means making sure everyone, including people with disabilities, can use Bitcoin apps.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Address",
    "technicalDefinition": "A Bitcoin address is a string of letters and numbers that represents a destination on the Bitcoin blockchain where Bitcoin can be sent. It is derived from a public key and serves as a unique identifier for receiving funds.",
    "definition": "An address is like your Bitcoin account number, where people can send you Bitcoin.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "ASICs",
    "technicalDefinition": "ASICs (Application-Specific Integrated Circuits) are specialized computer chips designed and manufactured for a single, specific task. In the context of Bitcoin, ASICs are specifically built for the highly repetitive and computationally intensive task of performing the SHA-256 hashing calculations required for Bitcoin mining. They are significantly more efficient and powerful for mining than general-purpose CPUs or GPUs.",
    "definition": "ASICs are super-fast computer chips made just for mining Bitcoin.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Bech32 Address",
    "technicalDefinition": "A Bech32 address is a native SegWit (Segregated Witness) Bitcoin address format that starts with \"bc1\". Bech32 uses a different encoding scheme (bech32) that is more efficient for storing SegWit witness data, resulting in lower transaction fees. It also has improved error detection capabilities and is case-insensitive, making it less prone to human error when transcribing.",
    "definition": "A Bech32 address is a newer, cheaper, and more error-proof way to send Bitcoin that starts with “bc1”.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "BFT (Byzantine Fault Tolerance)",
    "technicalDefinition": "Byzantine Fault Tolerance is the ability of a distributed network to reach consensus even when some nodes act maliciously or unpredictably. It ensures the system remains functional despite faults or adversarial behavior.",
    "definition": "A fancy way of saying: even if some computers in the network lie or break, the system can still work and stay secure. It’s how Bitcoin handles bad actors without falling apart.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Bitcoin",
    "technicalDefinition": "Bitcoin is a decentralized digital currency that operates on a peer-to-peer network. It is based on a distributed ledger called the blockchain, which records all transactions. Transactions are verified by network participants (miners) through a process called mining, which relies on a Proof-of-Work consensus mechanism. The supply of Bitcoin is limited and governed by its protocol rules.",
    "definition": "Bitcoin is digital money that runs without banks, that anyone with Internet access can participate in and contribute to using a public ledger called the blockchain.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Block",
    "technicalDefinition": "A block is a fundamental data structure in the Bitcoin blockchain. It is a container that holds a batch of validated Bitcoin transactions, a timestamp, a reference (cryptographic hash) to the previous block, and a nonce. Blocks are added chronologically to the blockchain through the mining process.",
    "definition": "A block is a group of Bitcoin transactions added to the blockchain.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Blockchain",
    "technicalDefinition": "A blockchain is a decentralized, append-only database where records (called blocks) are linked together chronologically using cryptographic hashes. Each participant maintains a copy of the ledger, ensuring transparency and immutability.",
    "definition": "A blockchain is like a shared notebook that everyone can see and no one can erase. New pages are added one after another, and once written, they can’t be changed.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Block Confirmation",
    "technicalDefinition": "Block confirmation is the process by which a newly created block is verified by the majority of the Bitcoin network nodes and added to their copy of the blockchain. Once a block is confirmed, the transactions contained within it are considered immutable and are effectively finalized.",
    "definition": "Block confirmation means the network has checked and accepted a new block as valid.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Block Explorer",
    "technicalDefinition": "A block explorer is an online tool or website that allows users to view and search the contents of a blockchain, such as the Bitcoin blockchain. It provides real-time data and historical information about blocks, transactions, addresses, network statistics, and more, offering a transparent window into the activity on the network.",
    "definition": "A block explorer is a website that lets you look up Bitcoin transactions and wallet activity.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Block Reward",
    "technicalDefinition": "The block reward is the sum of newly minted bitcoins and the transaction fees from the transactions included in a block that is awarded to the miner who successfully finds and adds that block to the blockchain. The amount of newly minted bitcoins in the block reward decreases over time through a process called halving.",
    "definition": "A block reward is the new Bitcoin and fees given to the miner who adds a new block.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "BOLT11 Invoice",
    "technicalDefinition": "A BOLT11 invoice is a standardized format for requesting a payment over the Lightning Network. Defined by the \"Basis of Lightning Technology\" (BOLT) specifications, a BOLT11 invoice is a long, encoded string that contains all the necessary information for a payer's Lightning wallet to route and complete a payment, including the recipient's node public key, the amount requested, a payment hash, and an expiry time.",
    "definition": "BOLT11 invoice is a Lightning payment request with all the details packed into one QR code or string on the Lightning network.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "BOLT12 Offer",
    "technicalDefinition": "This offers a newer, more flexible standard for requesting payments on the Lightning Network, designed to address some limitations of BOLT11 invoices. BOLT12 offers are reusable and allow for more complex interactions between payer and payee, such as requesting a payment without a predetermined amount (zero-amount offers) and supporting recurring payments. They provide enhanced privacy features compared to BOLT11 invoices.",
    "definition": "BOLT12 offers a reusable and flexible code for requesting Lightning payments, with extra privacy and features.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "BTC",
    "technicalDefinition": "BTC is the common abbreviation and ticker symbol used to represent Bitcoin.",
    "definition": "BTC is the short name for Bitcoin.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "CoinJoin",
    "technicalDefinition": "CoinJoin is a technique used to improve Bitcoin transaction privacy by combining inputs from multiple users into a single transaction. It is a collaborative transaction where several participants agree to mix their unspent transaction outputs (UTXOs) as inputs and define new outputs. While the transaction amounts are known, it becomes more difficult for external observers to trace which output belongs to which participant's input, breaking the direct link between sender and receiver.",
    "definition": "CoinJoin mixes your Bitcoin with others in one transaction to make it harder to trace, for more privacy.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Cold Storage",
    "technicalDefinition": "Cold storage refers to the practice of storing Bitcoin private keys offline, disconnected from the internet. This is achieved using hardware wallets, paper wallets, or air-gapped computers, significantly reducing the risk of theft from online attacks.",
    "definition": "Cold storage keeps your Bitcoin keys completely offline for better security.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Confirmation",
    "technicalDefinition": "A confirmation occurs when a Bitcoin transaction is included in a block that is added to the blockchain. Each subsequent block added on top of that block counts as an additional confirmation. A higher number of confirmations indicates a greater degree of finality and immutability for the transaction.",
    "definition": "A confirmation means your Bitcoin transaction has been added to the blockchain.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Consensus",
    "technicalDefinition": "Consensus refers to the mechanisms used by distributed systems like Bitcoin to agree on a single state of the network. It ensures that all participants have a consistent view of the blockchain, even in the presence of faults or malicious actors.",
    "definition": "A way for everyone in the Bitcoin network to agree on what’s true, like who owns what. Even without a boss, everyone follows the same rules to stay in sync.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Consensus Mechanism",
    "technicalDefinition": "A consensus mechanism in a distributed system like Bitcoin is the protocol or algorithm used to achieve agreement among the participating nodes on the validity of transactions and the state of the distributed ledger (blockchain). In Bitcoin, the consensus mechanism is Proof-of-Work (PoW), which requires miners to compete by expending computational resources to solve a cryptographic puzzle to validate blocks and reach a consensus.",
    "definition": "Bitcoin’s consensus mechanism is the system Bitcoin uses (Proof-of-Work) to make sure everyone agrees on the blockchain on which transactions are valid.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Custodian",
    "technicalDefinition": "In Bitcoin and cryptocurrencies, a custodian is a third party that holds and manages the private keys to a user's Bitcoin on their behalf. This is similar to how a bank holds funds for its customers.",
    "definition": "A custodian is a person who holds your Bitcoin for you, like a bank.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Decentralization",
    "technicalDefinition": "Decentralization is the core of Bitcoin, meaning that no single entity or point of control governs the network. It is maintained by a distributed network of nodes and miners, making it resistant to censorship and single points of failure.",
    "definition": "Decentralization means no single person or company controls Bitcoin.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Distributed Ledger",
    "technicalDefinition": "A distributed ledger is a database that is shared and synchronized across multiple computers or nodes in a network. In Bitcoin, the blockchain serves as a distributed ledger, maintaining a transparent, immutable, and cryptographically secured record of all Bitcoin transactions without a central authority.",
    "definition": "A distributed ledger is a shared online record book across the Bitcoin network that records all transactions that everyone can see and no one can secretly change.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Double-spend",
    "technicalDefinition": "A double-spend is an attack or error where the same Bitcoin is illegitimately spent more than once. The Bitcoin protocol, through its blockchain and consensus mechanism, is designed to prevent double-spending by ensuring that once a transaction is confirmed, the spent outputs cannot be used again.",
    "definition": "A double-spend is when someone tries to spend the same Bitcoin twice, which the network is designed to prevent.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Fiat Currencies",
    "technicalDefinition": "A medium of exchange is an asset or instrument that is widely accepted as a method for the payment of goods and services. It eliminates the inefficiencies of a barter system. Fiat currencies are government-issued money that is not backed by a physical commodity like gold or silver. Its value is derived from trust in the government that issues it.",
    "definition": "Fiat money is regular money, like Naira or Dollars that gets its value because the government says it does.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Full Node",
    "technicalDefinition": "A full node is a type of Bitcoin node that downloads and stores a complete copy of the entire Bitcoin blockchain. It independently verifies every transaction and block against Bitcoin's consensus rules, contributing to the security and decentralization of the network by enforcing the protocol rules without relying on third parties.",
    "definition": "A full node stores the whole Bitcoin history and checks all rules and transactions independently.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Fungibility",
    "technicalDefinition": "Fungibility is the property of an asset whereby individual units are interchangeable and indistinguishable in value. One unit is always equal to another.",
    "definition": "Fungibility means one piece of money is always the same as another piece of the same kind.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Genesis block",
    "technicalDefinition": "The genesis block is the very first block in the Bitcoin blockchain (Block 0). It is a unique block that was hardcoded into the initial Bitcoin software and serves as the foundation upon which all subsequent blocks are built.",
    "definition": "The genesis block is the very first block in the Bitcoin blockchain.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Hard Fork",
    "technicalDefinition": "A hard fork is a significant and often backward-incompatible change to the Bitcoin protocol. This involves a divergence in the blockchain where nodes running the old software version will not recognize blocks produced by nodes running the new version, potentially leading to a permanent split in the blockchain if not all participants upgrade.",
    "definition": "A hard fork is a big software change that splits a blockchain into two separate versions if not everyone agrees.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Hardware Categories",
    "technicalDefinition": "Bitcoin hardware categories typically refer to physical devices designed for interacting with Bitcoin. The most prominent are hardware wallets (securely storing private keys offline) and specialized mining hardware (like ASICs) built for the computationally intensive task of Bitcoin mining.",
    "definition": "Hardware categories are devices like hardware wallets for safe storage and special computers for mining Bitcoin.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Hardware Wallet",
    "technicalDefinition": "A hardware wallet is a physical electronic device designed specifically to securely store a user's Bitcoin private keys offline. Private keys are generated and stored within a secure element on the device and are never exposed to the internet. Transactions are signed on the hardware wallet, and only the signed transaction (but not the private key) is transmitted to the online device for broadcasting to the network, providing a high level of security for cold storage.",
    "definition": "A hardware wallet is a physical device that keeps your Bitcoin keys safe and offline.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Hash",
    "technicalDefinition": "A hash (or hash value) is the output of a cryptographic hash function. It is a fixed-size string of characters generated from an input of any size. In Bitcoin, hashing is used extensively in mining (proof-of-work) to secure the network, in creating Bitcoin addresses from public keys, and in organizing transactions within blocks using Merkle trees. A key property of cryptographic hash functions is that they are designed to be one-way (difficult to reverse) and that a small change in the input dramatically changes the output hash.",
    "definition": "A hash is a shuffled digital fingerprint used to secure Bitcoin data.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "HD Wallet (Hierarchical Deterministic)",
    "technicalDefinition": "This is a type of Bitcoin wallet that uses a single seed phrase (master seed) to deterministically generate a tree-like structure of cryptographic keys (private and public keys) and addresses. This hierarchical structure allows for the creation of a large number of addresses from a single backup and improves privacy by making it easy to use a new address for each transaction while still being able to recover all funds from the seed phrase.",
    "definition": "An HD wallet lets you create many new Bitcoin addresses from one backup phrase and helps keep your transactions private.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Hot Wallet",
    "technicalDefinition": "This is a Bitcoin wallet that is connected to the internet. The private keys are accessible by a device that is online, allowing for quick sending and receiving of transactions. However, being online makes them more susceptible to online threats and hacking compared to cold storage.",
    "definition": "A hot wallet is connected to the internet and is easy to use but more exposed to hacks.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "HTLC (Hashed Time‑Locked Contract)",
    "technicalDefinition": "HTLCs are a class of smart contracts used in the Lightning Network to facilitate secure and trustless routing of payments across multiple payment channels. They use a combination of hashlocks (requiring knowledge of a secret pre-image to claim funds) and timelocks (setting a time limit for claiming funds) to ensure that payments are either completed successfully across the route or the funds are safely returned to the sender.",
    "definition": "An HTLC is a smart contract that makes sure Lightning payments are safe and only go through if certain rules are met.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Importing Existing Wallet",
    "technicalDefinition": "This is the process of using a recovery phrase or private keys to access and control Bitcoin associated with a wallet that was previously created, typically on a different device or wallet software.",
    "definition": "To use your backup to access your old Bitcoin wallet on a new device.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Inclusion",
    "technicalDefinition": "Inclusion in Bitcoin refers to its open and permissionless nature, allowing anyone with an internet connection to participate in the network and use Bitcoin without needing approval from any authority, promoting financial access.",
    "definition": "Anyone, anywhere, can use Bitcoin without needing permission.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Interoperability",
    "technicalDefinition": "While not a primary focus of the base Bitcoin protocol itself, interoperability in the broader Bitcoin ecosystem refers to the ability of different Bitcoin wallets, services, and layers (like the Lightning Network) to work together and transact with each other.",
    "definition": "Bitcoin tools and networks can work together to send and receive Bitcoin.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Ledger",
    "technicalDefinition": "A ledger is a database that records transactions in a chronological and immutable manner. In blockchain systems, the ledger is decentralized and maintained by a network of nodes.",
    "definition": "A special notebook that keeps a permanent record of all transactions. In Bitcoin, this ledger is public and shared, so anyone can see what’s been written, but no one can erase or fake it.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Legacy Address (P2PKH)",
    "technicalDefinition": "A legacy address, specifically a Pay-to-Public-Key-Hash (P2PKH) address, is the original and oldest type of Bitcoin address format. These addresses typically start with the number '1'. Sending Bitcoin to a P2PKH address locks the funds such that they can only be spent by providing the corresponding public key and a digital signature created with the matching private key.",
    "definition": "A legacy address is an old-style Bitcoin address that starts with “1” and uses a public key and signature to unlock funds.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Light Client",
    "technicalDefinition": "A light client (or SPV client, Simplified Payment Verification) is a type of Bitcoin wallet that does not download the entire blockchain. Instead, it relies on full nodes to provide it with the necessary information to verify transactions, typically by downloading only block headers and using Merkle trees to confirm that its transactions are included in valid blocks. Light clients are more convenient for devices with limited storage and bandwidth but rely on the honesty of the full nodes they connect to.",
    "definition": "A light client is a smaller Bitcoin app that checks transactions using only parts of the blockchain, not the whole thing, with help from full nodes.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Lightning Invoice",
    "technicalDefinition": "A Lightning invoice is a standardized payment request used in the Lightning Network. It contains all the necessary information for a payer to send a specific amount of Bitcoin to a recipient over the Lightning Network, typically encoded as a string of characters or a QR code.",
    "definition": "A Lightning invoice is a message (or QR code) with all the details needed to send a Lightning payment on the Lightning Network.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Lightning Network",
    "technicalDefinition": "The Lightning Network is a second-layer payment protocol built on top of the Bitcoin blockchain. It is designed to enable fast, low-cost, and scalable micropayments by creating off-chain payment channels between users. Transactions within these channels can occur instantly and are only settled on the main Bitcoin blockchain when the channel is closed.",
    "definition": "The Lightning Network lets you send Bitcoin faster and cheaper using off-chain (special) payment channels.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "mBTC",
    "technicalDefinition": "mBTC stands for millibitcoin, which is a unit of Bitcoin equivalent to 0.001 BTC (one thousandth of a Bitcoin).",
    "definition": "mBTC equals one-thousandth of a Bitcoin (0.001 BTC).",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Mempool",
    "technicalDefinition": "The mempool (memory pool) is a collection of unconfirmed Bitcoin transactions that have been broadcast to the network but have not yet been included in a block by a miner. Each full node on the Bitcoin network maintains its own version of the mempool.",
    "definition": "The mempool is where Bitcoin transactions wait before being added to a block",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Merkle Tree",
    "technicalDefinition": "A Merkle tree (or hash tree) is a data structure used in Bitcoin to efficiently summarize and verify all the transactions within a block. It is a tree-like structure where each \"leaf\" node is a hash of a transaction, and each \"branch\" node is a hash of the two nodes below it. The single hash at the top of the tree is called the Merkle root and is included in the block header. This allows for the verification of a specific transaction's inclusion in a block by only needing a small number of hashes along the path from the transaction to the Merkle root, rather than the entire block.",
    "definition": "A Merkle tree is a way to organize and verify lots of Bitcoin transactions using just a few hashes in a Bitcoin block.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Miner",
    "technicalDefinition": "A miner in the Bitcoin network is an entity (individual or group) that uses specialized computing hardware to perform the computational work required to validate transactions and add new blocks to the blockchain through a process called mining. Miners are incentivized by block rewards and transaction fees.",
    "definition": "A miner is someone who uses computers to add new blocks and earn Bitcoin rewards",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Mining",
    "technicalDefinition": "This is a process in the Bitcoin network by which new transactions are validated and added to the blockchain. It involves miners using computational power to solve a complex cryptographic puzzle (Proof-of-Work). The first miner to solve the puzzle gets to propose the next block and is rewarded.",
    "definition": "Mining is the process of using computers to secure Bitcoin and earn rewards",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Multisignature Address",
    "technicalDefinition": "A multisignature (multisig) address is a type of Bitcoin address that requires multiple private keys to authorize a transaction. Funds sent to a multisig address are locked by a script that specifies a required number of signatures out of a total number of possible keys (e.g., 2-of-3, requiring 2 out of 3 designated keys to sign). This enhances security by distributing control over the funds.",
    "definition": "A multisignature address needs more than one person’s approval (keys) to spend the Bitcoin stored in it.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Multisig Wallet",
    "technicalDefinition": "(See Multisignature address) Multisig wallet is a wallet that implements the technical requirements of a multisignature address, requiring multiple private keys to sign transactions.",
    "definition": "A multisig wallet needs multiple people or devices to approve spending Bitcoin from it.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Network Protocol",
    "technicalDefinition": "A network protocol is a formal set of rules and conventions that determine how data is transmitted and received over a network. In Bitcoin, the protocol ensures that nodes communicate effectively, propagate transactions and blocks, and stay synchronized.",
    "definition": "A set of rules that computers follow to talk to each other. In Bitcoin, it's like the language that all the nodes use to agree on what’s happening on the network.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Node",
    "technicalDefinition": "A node in the Bitcoin network is a computer or server that runs the Bitcoin software and participates in the peer-to-peer network. Nodes communicate with each other to relay transactions and blocks, and they contribute to the decentralized nature of the network.",
    "definition": "A node is a computer that helps run, support, and share information on the Bitcoin network",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Non-custodial Wallet",
    "technicalDefinition": "A non-custodial wallet is a type of Bitcoin wallet where the user has sole control and management of their private keys. The wallet software or hardware provides the user with the private keys or a seed phrase that can be used to derive them, ensuring that only the user has the ability to authorize transactions and access their Bitcoin.",
    "definition": "Non-custodial wallet is one where only you control the keys and access to your Bitcoin",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Onion Routing",
    "technicalDefinition": "Onion routing is a technique used in the Lightning Network (and other privacy-focused networks) to route payments across multiple nodes in a way that protects the privacy of the sender and receiver. The payment information is encrypted in layers, like an onion, with each node in the route only being able to decrypt one layer to reveal the next hop, without knowing the full path.",
    "definition": "Onion routing hides the payment path by wrapping it in layers of encryption, so no one sees the full route.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Opcode",
    "technicalDefinition": "Opcodes (operation codes) are the fundamental instructions or commands that make up the Bitcoin Scripting language. Technically, each opcode is a single byte that performs a specific operation on the data stack during the execution of a Bitcoin transaction script, defining the conditions under which Bitcoin outputs can be spent.",
    "definition": "An opcode is a simple command that tells Bitcoin how to handle a transaction.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Open Design",
    "technicalDefinition": "Open design in Bitcoin refers to its open-source nature, where the code and protocol are publicly available for anyone to review, contribute to, and build upon. This transparency and collaborative development contribute to its security and innovation.",
    "definition": "Bitcoin Code is open to anyone to see and help improve Bitcoin’s code.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "OP_VAULT (BIP-345)",
    "technicalDefinition": "OP_VAULT is a proposed Bitcoin opcode (defined in BIP-345) designed to enable the creation of secure \"vaults\" for storing Bitcoin. It facilitates the implementation of covenants that enforce specific spending conditions, typically involving a time delay and a designated recovery path, to protect funds from theft in case of private key compromise.",
    "definition": "OP_VAULT is a proposed tool to lock up Bitcoin with extra safety rules in case your keys get stolen.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Ordinals",
    "technicalDefinition": "Ordinals is a numbering scheme for individual satoshis (the smallest unit of Bitcoin) based on the order in which they are mined and transferred. The Ordinal theory assigns a unique serial number to each satoshi, allowing them to be tracked and imbued with data (inscriptions) to create unique digital artifacts on the Bitcoin blockchain, similar to NFTs on other chains.",
    "definition": "Ordinals give each tiny piece of Bitcoin (satoshi) a unique number so it can carry special data like art or messages and also track it.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "P2SH Address",
    "technicalDefinition": "A P2SH (Pay-to-Script-Hash) address is a type of Bitcoin address that starts with the number '3.' Technically, sending Bitcoin to a P2SH address locks the funds to a hash of a script (a set of spending conditions). To spend the funds, the redeemer must provide the actual script that matches the hash and the necessary data (like signatures) that satisfies the conditions defined in the script. P2SH enables more complex transaction types like multisignature transactions.",
    "definition": "A P2SH is a Bitcoin address that starts with “3” that allows for more complex spending rules and setups like multisig wallets.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Payment Channel",
    "technicalDefinition": "A payment channel in the Lightning Network is a bidirectional connection established between two participants by locking a certain amount of Bitcoin on the main blockchain in a 2-of-2 multisignature address. Participants can then conduct an unlimited number of off-chain transactions within the channel, updating a shared balance without broadcasting each transaction to the main chain.",
    "definition": "A payment channel is a private link where two people can send Bitcoin back and forth instantly.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Peer‑to‑peer Network",
    "technicalDefinition": "The Bitcoin network operates as a peer-to-peer (P2P) network, meaning that computers running the Bitcoin software connect directly to each other to share information (transactions and blocks) without the need for a central server or authority. This decentralized architecture is fundamental to Bitcoin's censorship resistance and resilience.",
    "definition": "Bitcoin runs on a peer-to-peer network where users connect directly without needing a central server.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Permissionless",
    "technicalDefinition": "The Bitcoin network is a permissionless system that is open for anyone to join and participate in without needing authorization from a central authority. This applies to sending and receiving transactions, running a node, or participating in the consensus mechanism (mining). There are no gatekeepers controlling who can use the network.",
    "definition": "Anyone can use Bitcoin—no ID, approval, or permission is needed from any figure of authority.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Portability",
    "technicalDefinition": "Portability means the ease with which money or an asset can be transported and used for transactions in different locations.",
    "definition": "Portability means you can carry and use your money anywhere.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Privacy",
    "technicalDefinition": "Privacy in Bitcoin is achieved through the use of pseudonymous addresses rather than real-world identities. However, due to the transparent nature of the blockchain, advanced analysis can potentially link transactions and addresses, so achieving strong privacy often requires careful usage and additional techniques.",
    "definition": "Bitcoin uses anonymous addresses, but extra steps are needed for stronger privacy.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Private Keys",
    "technicalDefinition": "A private key is a secure, randomly generated alphanumeric code that is essential for accessing and spending Bitcoin associated with a specific Bitcoin address. It is a critical component of asymmetric cryptography used in Bitcoin, allowing the owner to create digital signatures to authorize transactions. Possession of the private key is proof of ownership of the bitcoins controlled by the corresponding address. It must be kept a secret and confidential.",
    "definition": "A secret code that lets you access and spend your Bitcoin—never share it.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Proof‑of‑work",
    "technicalDefinition": "Proof-of-Work is the consensus mechanism used by Bitcoin. It is a system that requires participants (miners) to expend significant computational effort to solve a mathematical puzzle to propose a new block. This process makes it computationally expensive and impractical for a malicious actor to tamper with the blockchain or gain control of the network.",
    "definition": "Proof-of-Work is a system where miners solve puzzles with computers to secure Bitcoin and add new blocks",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "PSBT (Partially Signed Bitcoin Transaction / BIP174)",
    "technicalDefinition": "A PSBT (Partially Signed Bitcoin Transaction), defined in BIP174, is a standardized format for exchanging Bitcoin transaction data between different wallets and software. A PSBT contains all the information required to construct and sign a Bitcoin transaction, but it may not be fully signed. This format is important for multi-party signing, offline signing (with hardware wallets), and complex transaction workflows like CoinJoin.",
    "definition": "A PSBT is an unfinished Bitcoin transaction that can be safely passed between wallets to be signed by several people or devices.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Pseudonymous",
    "technicalDefinition": "In the context of Bitcoin, pseudonymous means that while transactions are recorded on the public ledger (blockchain) with Bitcoin addresses, the real-world identity of the individuals or entities controlling those addresses is not directly revealed. Users are identified by their public addresses (pseudonyms), which can be changed for each transaction for privacy, but the history of transactions linked to a specific address is publicly viewable.",
    "definition": "Bitcoin uses fake names (addresses), not your real name, to keep things private. So only your Bitcoin address is shown.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Public Key",
    "technicalDefinition": "A public key is a cryptographic code that is mathematically derived from a private key. Unlike the private key, the public key is designed to be shared. It is used to generate a Bitcoin address, which is where bitcoins can be sent. When a transaction is initiated using a private key, the corresponding public key is used by the network to verify the digital signature, ensuring that the transaction was authorized by the owner of the bitcoins without revealing the private key.",
    "definition": "A public key is like your Bitcoin username/address that you share for others to use to send you Bitcoin.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Replace-by-fee (RBF)",
    "technicalDefinition": "This is a Bitcoin feature that allows a sender to replace an unconfirmed transaction with a new version of the transaction that pays a higher transaction fee. This is useful when the original transaction is taking a long time to confirm due to a low fee, enabling the sender to incentivize miners to prioritize the new transaction with the increased fee.",
    "definition": "RBF lets you resend a stuck Bitcoin transaction with a higher fee to speed it up.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Satoshi",
    "technicalDefinition": "A Satoshi (sat) is the smallest unit of Bitcoin, equivalent to 0.00000001 BTC (one hundred millionth of a Bitcoin). It is named after the pseudonymous creator(s) of Bitcoin, Satoshi Nakamoto.",
    "definition": "A satoshi is the smallest piece of Bitcoin, like a cent to a dollar, worth 0.00000001 BTC.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Seed Phrase",
    "technicalDefinition": "Also known as a recovery phrase or mnemonic phrase, it is a sequence of typically 12 or 24 words that is generated by a Bitcoin wallet. This phrase acts as a master backup key, allowing users to restore access to their entire wallet and all associated Bitcoin funds if their original wallet is lost, damaged, or inaccessible. It is a human-readable representation of the private keys controlling the Bitcoin.",
    "definition": "This is a list of words that lets you recover your entire Bitcoin wallet if you lose it.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Self-Custodial",
    "technicalDefinition": "Self-custodial is the practice of an individual holding and controlling their own private keys for their Bitcoin. Meaning they have direct control over their funds without relying on a third party.",
    "definition": "Self-custodial means you alone control your Bitcoin and private keys.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "SHA‑256",
    "technicalDefinition": "SHA-256 (Secure Hash Algorithm 256-bit) is a cryptographic hash function used extensively in Bitcoin. It takes an input (data of any size) and produces a fixed-size output of 256 bits (32 bytes), which is a unique \"fingerprint\" of the input. SHA-256 is used in mining (Proof-of-Work), generating Bitcoin addresses, and within the Merkle tree structure to ensure data integrity and security. It is designed to be collision-resistant (hard to find two different inputs that produce the same output) and computationally infeasible to reverse engineer the input from the hash.",
    "definition": "SHA-256 is a special math formula that turns any data into a unique 256-bit code used for security in Bitcoin.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Sidechains",
    "technicalDefinition": "Sidechains are separate blockchains that are designed to be interoperable with a main blockchain, such as Bitcoin. Which is a two-way peg mechanism that allows assets from the main chain to be transferred to the sidechain and back, enabling new features, scalability, or different consensus mechanisms to be explored on the sidechain without altering the core functionality of the main chain.",
    "definition": "Sidechains are extra blockchains that work with Bitcoin to test new features or improve speed without changing Bitcoin itself.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Smart Contracts",
    "technicalDefinition": "Smart contracts are self-executing pieces of code that run on a blockchain. They automatically enforce the terms of an agreement when predefined conditions are met, without requiring intermediaries.",
    "definition": "Digital “if-this-then-that” agreements that run automatically. Once the conditions are met, the contract does what it’s programmed to do. No lawyers, no middlemen",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Software Categories",
    "technicalDefinition": "In Bitcoin, software categories broadly refer to different types of applications that interact with the Bitcoin network and ecosystem. These include wallet software (managing keys and transactions), node software (connecting to and validating the network), mining software (managing mining hardware), exchange software (facilitating trading), and block explorers (viewing blockchain data).",
    "definition": "Different types of Bitcoin apps do things like store Bitcoin, verify the network, mine, trade, or show data.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Software Wallet",
    "technicalDefinition": "A software wallet is a Bitcoin wallet implemented as a software application that runs on a computer, smartphone, or within a web browser. It stores and manages the user's private keys digitally and provides an interface to interact with the Bitcoin network to send and receive transactions. Software wallets can be hot (connected to the internet) or used for cold storage (offline).",
    "definition": "A software wallet is an app or program that stores your Bitcoin keys on your computer or phone and lets you send or receive payments.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "SPV wallet",
    "technicalDefinition": "(See Light client) An SPV wallet is a light client that uses Simplified Payment Verification to verify transactions without downloading the entire blockchain, relying on block headers and Merkle proofs.",
    "definition": "An SPV wallet checks transactions using only parts of the blockchain, without downloading the full blockchain.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Technology Primer",
    "technicalDefinition": "For Bitcoin, this is an introductory resource that explains the fundamental technical components and concepts underlying Bitcoin, such as the blockchain, cryptography (hashing, public-key cryptography), the peer-to-peer network, transactions, and mining (proof-of-work), in a clear and accessible manner.",
    "definition": "A technology primer explains the basics of how Bitcoin works in simple terms.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Transaction",
    "technicalDefinition": "A transaction is a signed data structure that proposes the transfer of Bitcoin value from one or more inputs (representing unspent outputs from previous transactions) to one or more outputs (new unspent outputs assigned to Bitcoin addresses). These transactions are broadcast to the network, verified by nodes, and included in blocks by miners to be permanently recorded on the blockchain.",
    "definition": "A transaction is when you send or receive Bitcoin",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Transaction Fee",
    "technicalDefinition": "A transaction fee is an amount of Bitcoin included in a transaction by the sender as an incentive for miners to include that transaction in a block. The fee amount can influence how quickly a transaction is confirmed, as miners typically prioritize transactions with higher fees, especially when the network is busy.",
    "definition": "A transaction fee is extra Bitcoin you pay to get your transaction processed by miners.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Transparency",
    "technicalDefinition": "Transparency in Bitcoin comes from the public nature of the blockchain, where all transactions are recorded and can be viewed by anyone. While user identities are pseudonymous, the flow of value on the network is transparent.",
    "definition": "Everyone can see all Bitcoin transactions on the public blockchain.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Unspent Transaction Output (UTXO)",
    "technicalDefinition": "A UTXO is an amount of Bitcoin that has been received in a transaction but has not yet been spent. They represent the digital equivalent of physical coins or bills in your wallet; your total Bitcoin balance is the sum of all UTXOs that your wallet controls the private keys for. When you spend Bitcoin, you use existing UTXOs as inputs for a new transaction, which creates new UTXOs as outputs for the recipient and any change returning to you.",
    "definition": "A UTXO is Bitcoin you’ve received and own but have yet to spend.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Vault",
    "technicalDefinition": "In cryptocurrency security, a vault is a method of securely storing cryptocurrency that involves security features beyond a standard wallet, such as time-delayed withdrawals, multi-signature requirements, or integration with smart contracts for controlled access. Vaults are typically used for storing larger amounts of cryptocurrency for the long term.",
    "definition": "A vault is a really secure way to store Bitcoin for a long time.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Watchtower",
    "technicalDefinition": "A watchtower is a service or node that monitors the Bitcoin blockchain on behalf of a Lightning Network user who may be offline. If a malicious peer in a payment channel attempts to broadcast an old, unfavorable channel state to the blockchain, the watchtower can detect this and broadcast a \"justice transaction\" to penalize the cheating peer and recover the user's funds.",
    "definition": "A watchtower is a service that watches the blockchain for fraud on the Lightning channels and protects users who are offline.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Wallet",
    "technicalDefinition": "A Bitcoin wallet is a software application or hardware device that manages a user's Bitcoin addresses and their corresponding private keys. While it doesn't technically \"store\" Bitcoin (which exists on the blockchain), it provides the interface for users to check their balance, send, and receive Bitcoin by interacting with the Bitcoin network.",
    "definition": "A wallet is an app or device that lets you send, receive, and manage Bitcoin.",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Wallet Software",
    "technicalDefinition": "Wallet software is a program that runs on a computer or mobile device and interacts with the Bitcoin network on behalf of a user. Technically, it manages the user's cryptographic keys (private and public keys), constructs and signs Bitcoin transactions, and communicates with Bitcoin nodes to broadcast transactions and query blockchain data to display balances and transaction history.",
    "definition": "This lets you send, receive, and manage your Bitcoin, using your computer or phone",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  },
  {
    "name": "Wrapped Bitcoin (WBTC)",
    "technicalDefinition": "Wrapped Bitcoin (WBTC) is an ERC-20 token on the Ethereum blockchain that is pegged 1:1 with Bitcoin. WBTC is created by \"wrapping\" Bitcoin through a process involving custodians who hold the actual BTC and mint an equivalent amount of WBTC on Ethereum. This allows Bitcoin holders to participate in Ethereum's decentralized finance (DeFi) ecosystem.",
    "definition": "Wrapped Bitcoin is Bitcoin turned into an Ethereum token so it can be used on the Ethereum network",
    "illustration": {
      "asset": {
        "url": "/illustrations/hero.svg"
      }
    }
  }
]
